---
kind: method
id: M:Autodesk.Revit.DB.CurveLoop.#ctor
source: html/24352cb6-d39e-afbc-800e-38d0ebf98fe6.htm
---
# Autodesk.Revit.DB.CurveLoop.#ctor Method

Constructs a new empty curve loop.

## Syntax (C#)
```csharp
public CurveLoop()
```